{
  "backend/main.mo": "Actor implementing user profile storage with authorization checks and a contact form submission list accessible only to admins.",
  "feature_evidence.json": "Feature-evidence metadata mapping site features to source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Global Tailwind-based theme definitions using OKLCH colors for light/dark modes and base element styling.",
  "frontend/index.html": "HTML entry point bootstrapping the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React component handling hash-based navigation between the marketing site and the admin inquiries page.",
  "frontend/src/components/auth/LoginButton.tsx": "Internet Identity login/logout button with loading states and query cache clearing.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Guard component enforcing admin-only access with loading, login, and access-denied states.",
  "frontend/src/components/contact/ContactForm.tsx": "Validated contact form with success state and backend submission via a mutation hook.",
  "frontend/src/components/site/Footer.tsx": "Renders site footer with branding, quick links, contact details, and social icons, including smooth-scroll handlers.",
  "frontend/src/components/site/Header.tsx": "Implements a sticky header with desktop and mobile navigation using smooth scrolling and a responsive sheet menu.",
  "frontend/src/components/site/sections/About.tsx": "Displays an About section with academy values, philosophy, and styled content cards.",
  "frontend/src/components/site/sections/Contact.tsx": "Provides contact info cards and embeds a contact form within a two-column layout.",
  "frontend/src/components/site/sections/FAQ.tsx": "Renders an FAQ section using an accordion populated with predefined questions and answers.",
  "frontend/src/components/site/sections/HomeHero.tsx": "Creates a hero section with background images, CTAs that scroll to sections, and highlight stats.",
  "frontend/src/components/site/sections/Instructors.tsx": "Renders an instructors section listing instructor profiles with names, ranks, specialties, and bios using card components.",
  "frontend/src/components/site/sections/Pricing.tsx": "Displays membership pricing plans with features, highlighting the most popular option and including a scroll-to-contact button.",
  "frontend/src/components/site/sections/Programs.tsx": "Shows a list of martial arts programs with icons, descriptions, and feature lists, including a highlighted competition team option.",
  "frontend/src/components/site/sections/Schedule.tsx": "Provides a weekly class schedule rendered in cards, listing times, programs, and levels for each day.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useAdminInquiries.ts": "Fetches and sorts contact form submissions for admins using the authenticated actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, managing login, stored identities, and related status flags.",
  "frontend/src/hooks/useSubmitContactForm.ts": "Provides a mutation hook to submit contact form data through the backend actor and refresh inquiry data on success.",
  "frontend/src/index.css": "Defines Tailwind layers plus light and dark theme OKLCH CSS variables and global typography/utility styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping App with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminInquiries.tsx": "Admin page that loads, displays, and manages contact inquiries with loading, error, and empty states.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters with sessionStorage fallback.",
  "frontend/tailwind.config.js": "Tailwind config extending colors, shadows, animations, and theme tokens using OKLCH variables and plugins.",
  "project_state.json": "JSON metadata describing project state, features, requirements, and image needs for the taekwondo website."
}